CSI API ETABS v1
cGroup.GetAssignments Method
 Retrieves the assignments to a specified group
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAssignments(
	string Name,
	ref int NumberItems,
	ref int[] ObjectType,
	ref string[] ObjectName
)
Function GetAssignments (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef ObjectType As Integer(),
	ByRef ObjectName As String()
) As Integer
Dim instance As cGroup
Dim Name As String
Dim NumberItems As Integer
Dim ObjectType As Integer()
Dim ObjectName As String()
Dim returnValue As Integer
returnValue = instance.GetAssignments(Name,
	NumberItems, ObjectType, ObjectName)
int GetAssignments(
	String^ Name,
	int% NumberItems,
	array<int>^% ObjectType,
	array<String^>^% ObjectName
)
abstract GetAssignments :
        Name : string *
        NumberItems : int byref *
        ObjectType : int[] byref *
        ObjectName : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing group
NumberItems
Type: System.Int32
 The number of assignments made to the specified group
ObjectType
Type: System.Int32[]
 This is an array that includes the object type of each item in the group.
Point object
Frame object
Cable object
Tendon object
Area object
Solid object
Link object
ObjectName
Type: System.String[]
 This is an array that includes the name of each item in the group
Return Value
Type: Int32
 Returns zero if the group assignment is successfully retrieved, otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberItems As Integer
       Dim ObjectType() As Integer
       Dim ObjectName() As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'define new group
       ret = SapModel.GroupDef.SetGroup("Group1")
   'add point objects to group
       ret = SapModel.PointObj.SetGroupAssign("3", "Group1")
       ret = SapModel.PointObj.SetGroupAssign("6", "Group1")
       ret = SapModel.PointObj.SetGroupAssign("9", "Group1")
   'add frame objects to group
       ret = SapModel.FrameObj.SetGroupAssign("8", "Group1")
       ret = SapModel.FrameObj.SetGroupAssign("10", "Group1")
   'get group assignments
       ret = SapModel.GroupDef.GetAssignments("Group1", NumberItems, ObjectType, ObjectName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cGroup Interface
ETABSv1 Namespace